<template><h1 id="使用和开发-babylon-js" tabindex="-1"><a class="header-anchor" href="#使用和开发-babylon-js" aria-hidden="true">#</a> 使用和开发 Babylon.js</h1>
<p>对于想了解Babylon.js的组织和架构的人来说，为了使用它来开发自己的结构良好的项目或为它做贡献，你来到了正确的地方。在这里，你可以获得Babylon.js的全部内容，或者只是你需要导入到你的JavaScript或Typescript应用程序的模块。</p>
<p>即使是最好的开发者也会不时地需要帮助，Babylon.js论坛就是为了帮助他们。为了更好地利用论坛，请查看本节的第一页。</p>
<p>贡献可以有多种形式。在论坛上回答问题就是一种有用的贡献。其他人可能会发现文档中的拼写错误，或者是改进文档的方法。Babylon.js的潜在贡献者可以来自许多不同的背景。对你们中的一些人来说，版本控制器、仓库、包管理器和任务运行器是你们的第二天性，你们只需要知道Babylon.js核心团队设定的要求，就可以接受拉取请求。对于我们中的其他人，也许只是想探索3D的世界，他们开始时可能是一系列混乱的障碍。所以本节将包含一些细节，你们中的许多人可以忽略这些明显的细节。对其他人来说，这些细节可能是做出贡献与否的区别。</p>
</template>
