<template><h1 id="网格变换-transformations" tabindex="-1"><a class="header-anchor" href="#网格变换-transformations" aria-hidden="true">#</a> 网格变换 Transformations</h1>
<p>变换 Transformations 是改变物体的位置、旋转和大小的动作。尽管本节主要涉及应用于网格的变换，但有些变换也可以应用于其他Babylon.js物体。</p>
<p>应用变换看起来很简单，在许多情况下也是如此，例如改变位置。其他方面可能看起来很容易，但在实践中可能在概念上、执行上或两者都很困难。在三维中，像旋转这样简单的事情可能会被证明是棘手的，一旦你围绕x和y旋转了一个网格，那么它的z轴可能就不在你认为的位置了，因为一个网格的局部参照系会随着它旋转。</p>
<p>参考系，在三维中，由一个原点和通过原点的三个相互垂直的轴构成。在Babylon.js中创建物体时，使用<strong>世界空间</strong>的参考系，其中有两个水平轴，x和z，以及左手系统的垂直y轴。</p>
<p>每个网格也有自己的<strong>局部空间</strong>。在Babylon.js中建立的网格，其局部空间原点位于世界空间原点，其局部空间的x、y、z轴与世界空间的x、y、z轴对齐。本地原点作为转换的中心，除非在网格上添加轴心点或父节点。这两种情况都会讲述。</p>
<p>在其他软件中创建并导入的网格可能使用不同的参考系。</p>
</template>
